pahalllooolll/scope_esp32s3/scope_esp32s3.ino
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h> 
#include <SPI.h>
#include <TFT_eSPI.h>
#include <Adafruit_NeoPixel.h>

TFT_eSPI tft = TFT_eSPI();
TFT_eSprite menuSpr = TFT_eSprite(&tft); 
Preferences prefs;
WebServer server(80); 
Adafruit_NeoPixel led(1, 48, NEO_GRB + NEO_KHZ800);

// --- НАСТРОЙКИ КНОПОК И ПИЩАЛКИ ---
#define BTN_UP    41
#define BTN_DOWN  40
#define BTN_LEFT  39
#define BTN_RIGHT 37
#define BTN_OK    36

#define TEST_WAVE_PIN 42  
#define TFT_BL_PIN    38     
#define BUZZER_PIN    35     // <-- ПИН ПИЩАЛКИ

bool lastStateUP    = HIGH;
bool lastStateDOWN  = HIGH;
bool lastStateLEFT  = HIGH;
bool lastStateRIGHT = HIGH;
bool lastStateOK    = HIGH;

// --- НАСТРОЙКА ПИНОВ И ЦВЕТОВ ---
const int adcPins[] = {4, 5, 9}; 
const int NUM_ADC_PINS = 3;
bool pinEnabled[NUM_ADC_PINS] = {true, true, true}; 
int pinColorIndices[NUM_ADC_PINS] = {5, 2, 6};

const uint16_t avaliableColors[] = {TFT_WHITE, TFT_RED, TFT_GREEN, TFT_BLUE, TFT_YELLOW, TFT_CYAN, TFT_MAGENTA};
const char* colorNames[] = {"WHITE", "RED", "GREEN", "BLUE", "YELLOW", "CYAN", "MAGENTA"};

// --- ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ ГРАФИКА ---
volatile float voltage = 0.0;
int xPos = 0;
int prevX = 0;
int prevYPins[NUM_ADC_PINS] = {100, 100, 100};

const int WAVE_BUFFER_SIZE = 60;
int waveBuffer[WAVE_BUFFER_SIZE];
int waveBufferIdx = 0;

volatile int currentMinAdc = 4095;
volatile int currentMaxAdc = 0;
volatile int lastMinAdc = 0;
volatile int lastMaxAdc = 4095;
volatile int crossings = 0;
unsigned long sweepStartTime = 0;
volatile float freqHz = 0.0;
volatile float vMax = 0.0;
volatile float vMin = 0.0;
bool isFrozen = false; 
bool wasAboveMidpoint = false;

// Параметры меню
int graphSpeed;
int smoothLevel;     
int zoomIndex;       
bool useGrid;
int ledMode;         
int ledColorIndex;   
int testFreqIndex;   
bool wifiEnabled = true; 
int brightnessIndex = 0;    
volatile bool generatorChanged = false;

int triggerMode = 0;    
int couplingMode = 0;   
int vDivIndex = 1;      
int themeColorIdx = 0;  
bool buzzerEnabled = false;

const int zoomLevels[] = {1, 2, 4, 8};
const char* smoothNames[] = {"DISABLED", "LIGHT", "MEDIUM", "STRICT"};
const char* ledModes[] = {"DISABLED", "STATIC", "RAINBOW", "SWEEP"};
const char* ledColorNames[] = {"WHITE", "RED", "GREEN", "BLUE", "YELLOW", "CYAN", "MAGENTA"};
const int brightnessLevels[] = {255, 128, 50};
const char* brightnessNames[] = {"100%", "50%", "20%"};
const int testFreqs[] = {10, 50, 100, 500, 1000, 5000, 10000, 100000};
const char* freqNames[] = {"10 Hz", "50 Hz", "100 Hz", "500 Hz", "1 kHz", "5 kHz", "10 kHz", "100 kHz"};
const int NUM_FREQS = 8;
const uint8_t ledRGBValues[][3] = {{255,255,255},{255,0,0},{0,255,0},{0,0,255},{255,255,0},{0,255,255},{255,0,255}};

const uint16_t themeColors[] = {TFT_CYAN, TFT_YELLOW, TFT_RED, TFT_GREEN};
const char* themeNames[] = {"CYAN Neon", "GOLD Cyber", "RED Plasma", "GREEN Matrix"};

uint8_t rainbowHue = 0;
unsigned long lastLedUpdate = 0;
int sweepDirection = 1;
int sweepVal = 0;

// --- ПЕРЕМЕННЫЕ МЕНЮ И АНИМАЦИИ ---
int currentMode = 0; 
int menuCursor = 0;
int menuScrollOffset = 0; 
const int MAX_VISIBLE_ITEMS = 4; 
const int MENU_ITEMS_COUNT = 17;

float currentScrollY = 0.0; 
float currentVisualY = 2.0;
float channelsScrollY = 0.0;
float channelsVisualY = 2.0;

int pulseState = 0;
int pulseDir = 1;
int pinsSubCursor = 0;
int wifiSubCursor = 0;

// ТАЙМЕР ХИНКАЛИ
int khinkaliTimerSec = 420; 
bool khinkaliRunning = false;
unsigned long lastKhinkaliSecTick = 0;
int steamAnimFrame = 0;

// ПРОТОТИПЫ
void loadSettings(); void saveSettings(); void handleButtons(); void drawOscilloscope();
void drawGrid(); void updateLED(); void handleLEDAnimations(); uint32_t ledWheel(uint8_t wheelPos);
void initMenuScreen(); void updateMenuDisplay(); void updatePinsMenuDisplay(); void updateWiFiMenuDisplay();
void updateGenerator(); void toggleWiFi(); void updateBrightness(); void drawKhinkaliScreen();

// --- ФУНКЦИЯ ПИЩАЛКИ ---
void beep(int freq, int duration) {
  if (buzzerEnabled) {
    tone(BUZZER_PIN, freq, duration);
  }
}

// --- ВЕБ ИНТЕРФЕЙС ---
const char PAGE_MAIN[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1.0'><title>Quantum Scope UI</title>
<style>
:root { --bg: #05050a; --card: #0d0d1f; --accent: #00ffcc; --magenta: #ff007f; --text: #e0e0ff; }
body { background: var(--bg); color: var(--text); font-family: 'Segoe UI', sans-serif; margin: 0; padding: 20px; display: flex; flex-direction: column; align-items: center; }
h2 { color: var(--accent); text-shadow: 0 0 10px rgba(0,255,204,0.5); font-weight: 400; letter-spacing: 2px; }
#waveCanvas { background: #020205; border: 2px solid #1a1a3a; border-radius: 16px; box-shadow: 0 0 20px rgba(0,255,204,0.15); width: 100%; max-width: 550px; }
.grid { display: grid; grid-template-columns: repeat(2, 1fr); gap: 15px; width: 100%; max-width: 550px; margin: 20px 0; }
.card { background: var(--card); padding: 15px; border-radius: 12px; text-align: center; border: 1px solid #1a1a3a; box-shadow: inset 0 0 10px rgba(255,255,255,0.02); }
.card .label { font-size: 11px; color: #62628a; text-transform: uppercase; letter-spacing: 1px; }
.card .val { font-size: 22px; font-weight: bold; margin-top: 6px; font-family: monospace; }
.wifi-info { margin-top: 15px; font-size: 13px; color: #555577; text-align: center; border-top: 1px solid #111; padding-top: 10px; }
</style></head><body>
<h2>⚡ QUANTUM SCOPE OS ⚡</h2>
<canvas id="waveCanvas" width="550" height="240"></canvas>
<div class='grid'>
<div class='card'><div class='label'>⚡ Amplitude</div><div class='val' id='v' style='color:var(--accent)'>-- V</div></div>
<div class='card'><div class='label'>🔄 Frequency</div><div class='val' id='freq' style='color:var(--magenta)'>-- Hz</div></div>
</div>
<div class='wifi-info'>Connected to AP: ESP32-Scope | Control Center v2.5</div>
<script>
let canvas = document.getElementById('waveCanvas'); let ctx = canvas.getContext('2d');
setInterval(async () => {
try {
let r = await fetch('/data'); let j = await r.json();
document.getElementById('v').innerText = j.v.toFixed(2) + ' V';
document.getElementById('freq').innerText = j.freq >= 1000 ? (j.freq/1000).toFixed(2) + ' kHz' : j.freq.toFixed(0) + ' Hz';
ctx.clearRect(0, 0, canvas.width, canvas.height);
ctx.strokeStyle = '#0a0a1f'; ctx.lineWidth = 1; ctx.beginPath();
for(let m=1; m<4; m++) { ctx.moveTo(0, canvas.height*m/4); ctx.lineTo(canvas.width, canvas.height*m/4); } ctx.stroke();
ctx.strokeStyle = '#00ffcc'; ctx.lineWidth = 2.5; ctx.shadowBlur = 8; ctx.shadowColor = '#00ffcc'; ctx.beginPath();
for(let i=0; i<j.wave.length; i++) {
let x = (i / (j.wave.length-1)) * canvas.width; let y = canvas.height - ((j.wave[i] / 4095) * canvas.height);
if(i === 0) ctx.moveTo(x, y); else ctx.lineTo(x, y);
} ctx.stroke(); ctx.shadowBlur = 0;
}catch(e){} }, 150);
</script></body></html>)rawliteral";

void handleRoot() { server.send_P(200, "text/html", PAGE_MAIN); }
void handleData() {
  String json = "{\"v\":" + String(voltage) + ",\"freq\":" + String(freqHz) + ",\"wave\":[";
  for (int i = 0; i < WAVE_BUFFER_SIZE; i++) { json += String(waveBuffer[i]); if (i < WAVE_BUFFER_SIZE - 1) json += ","; }
  json += "]}"; server.send(200, "application/json", json);
}

