pahalllooolll/scope_esp32s3/scope_esp32s3.ino
void core0Task(void * pvParameters) {
  if (wifiEnabled) { 
    WiFi.softAP("ESP32-Scope", "12345678"); 
    server.on("/", handleRoot); 
    server.on("/data", handleData); 
    server.begin(); 
  }
  for (;;) { if (wifiEnabled) server.handleClient(); vTaskDelay(5 / portTICK_PERIOD_MS); }
}

void setup() {
  Serial.begin(115200);
  delay(500); 
  Serial.println("\n--- QUANTUM SCOPE OS INITIALIZATION ---");

  pinMode(BTN_UP, INPUT_PULLUP); pinMode(BTN_DOWN, INPUT_PULLUP);
  pinMode(BTN_LEFT, INPUT_PULLUP); pinMode(BTN_RIGHT, INPUT_PULLUP);
  pinMode(BTN_OK, INPUT_PULLUP);
  pinMode(TFT_BL_PIN, OUTPUT); pinMode(TEST_WAVE_PIN, OUTPUT); 
  pinMode(BUZZER_PIN, OUTPUT);
  
  loadSettings();
  led.begin(); led.setBrightness(50); updateBrightness();
  
  xTaskCreatePinnedToCore(core0Task, "Core0Task", 8192, NULL, 1, NULL, 0);
  updateGenerator(); 
  
  tft.init(); tft.setRotation(1); tft.fillScreen(TFT_BLACK);
  menuSpr.createSprite(tft.width(), 106);
  
  sweepStartTime = millis(); updateLED(); 
  Serial.println("[SYSTEM] Setup Complete. Mega-OS Ready.");
}

void loop() {
  handleButtons(); 
  handleLEDAnimations(); 

  if (generatorChanged) { 
    generatorChanged = false; 
    updateGenerator(); 
  }
  
  if (currentMode == 0) {
    if (!isFrozen) drawOscilloscope();
    if (graphSpeed == 0) delayMicroseconds(10); 
  } else {
    if (currentMode == 1) {
      updateMenuDisplay(); 
    } else if (currentMode == 4) {
      updatePinsMenuDisplay(); 
    } else if (currentMode == 5) {
      drawKhinkaliScreen();
    }
    delay(16); 
  }
}

void initMenuScreen() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(themeColors[themeColorIdx], TFT_BLACK);
  tft.drawString("⚡ QUANTUM CONFIG ⚡", 50, 5, 2); 
  tft.drawFastHLine(0, 24, tft.width(), tft.color565(40, 40, 80));
  tft.drawFastHLine(0, 132, tft.width(), tft.color565(40, 40, 80));
}

void updateMenuDisplay() {
  if (menuCursor < menuScrollOffset) menuScrollOffset = menuCursor;
  else if (menuCursor >= menuScrollOffset + MAX_VISIBLE_ITEMS) menuScrollOffset = menuCursor - MAX_VISIBLE_ITEMS + 1;

  float targetScrollY = menuScrollOffset * 26.0;
  currentScrollY += (targetScrollY - currentScrollY) * 0.20; 
  float targetVisualY = (menuCursor * 26.0) - currentScrollY + 2.0;
  currentVisualY += (targetVisualY - currentVisualY) * 0.30; 

  pulseState += pulseDir * 4;
  if (pulseState >= 50 || pulseState <= 0) pulseDir = -pulseDir;

  menuSpr.fillSprite(TFT_BLACK);
  uint16_t sliderColor = menuSpr.color565(40 + pulseState, 40 + pulseState, 90 + pulseState / 2);
  menuSpr.fillRect(4, (int)currentVisualY, menuSpr.width() - 8, 22, sliderColor);

  for (int i = 0; i < MENU_ITEMS_COUNT; i++) {
    float yTextPos = 5.0 + (i * 26.0) - currentScrollY;
    if (yTextPos < -20 || yTextPos > 110) continue; 

    if (i == menuCursor) menuSpr.setTextColor(TFT_GREEN, sliderColor);
    else menuSpr.setTextColor(TFT_WHITE, TFT_BLACK);

    String itemText = "";
    switch(i) {
      case 0:  itemText = "-> CHANNELS CONFIG"; break;
      case 1:  itemText = "ZOOM: " + String(zoomLevels[zoomIndex]) + "x"; break;
      case 2:  itemText = "FILT: " + String(smoothNames[smoothLevel]); break;
      case 3:  itemText = "SPEED: " + String(graphSpeed) + "ms"; break;
      case 4:  itemText = "GRID: " + String(useGrid ? "ON" : "OFF"); break;
      case 5:  itemText = "TRIGGER: " + String(triggerMode == 0 ? "AUTO" : "NORMAL"); break;
      case 6:  itemText = "COUPLING: " + String(couplingMode == 0 ? "DC" : "AC"); break;
      case 7:  itemText = "V-DIV: " + String(vDivIndex == 0 ? "0.5V" : vDivIndex == 1 ? "1.0V" : "2.0V"); break;
      case 8:  itemText = "THEME: " + String(themeNames[themeColorIdx]); break;
      case 9:  itemText = "BUZZER: " + String(buzzerEnabled ? "ON" : "OFF"); break;
      case 10: itemText = "GEN: " + String(freqNames[testFreqIndex]); break; 
      case 11: itemText = "LED M: " + String(ledModes[ledMode]); break;
      case 12: itemText = "LED C: " + String(ledColorNames[ledColorIndex]); break;
      case 13: itemText = "BRIGHT: " + String(brightnessNames[brightnessIndex]); break;
      case 14: itemText = "-> WI-FI SETTINGS"; break;
      case 15: itemText = "🥟 KHINKALI COOKER"; break;
      case 16: itemText = "[ SAVE & EXIT ]"; break;
    }
    menuSpr.drawString(itemText, 15, (int)yTextPos, 2);
  }
  menuSpr.pushSprite(0, 25);
}

void updatePinsMenuDisplay() {
  float targetScrollY = 0.0; 
  float targetVisualY = (pinsSubCursor * 26.0) + 2.0;
  channelsVisualY += (targetVisualY - channelsVisualY) * 0.30;

  menuSpr.fillSprite(TFT_BLACK);
  menuSpr.fillRect(4, (int)channelsVisualY, menuSpr.width() - 8, 22, menuSpr.color565(30, 60, 50));

  for (int i = 0; i < 4; i++) {
    float yTextPos = 5.0 + (i * 26.0);
    if (i == pinsSubCursor) menuSpr.setTextColor(TFT_GREEN, menuSpr.color565(30, 60, 50));
    else menuSpr.setTextColor(TFT_WHITE, TFT_BLACK);

    if (i < 3) {
      String name = (i==0)?"CH4 ":(i==1)?"CH5 ":"CH9 ";
      String status = pinEnabled[i] ? "[ON]" : "[OFF]";
      String colName = colorNames[pinColorIndices[i]];
      menuSpr.drawString(name + status + " | COLOR: " + colName, 15, (int)yTextPos, 2);
    } else {
      menuSpr.drawString("[ BACK ]", 15, (int)yTextPos, 2);
    }
  }
  menuSpr.pushSprite(0, 25);
}

void updateWiFiMenuDisplay() {
  tft.fillScreen(TFT_BLACK); 
  tft.setTextColor(themeColors[themeColorIdx], TFT_BLACK); 
  tft.drawString("=== WI-FI CONTROL ===", 55, 8, 2);
  tft.drawFastHLine(0, 26, tft.width(), themeColors[themeColorIdx]);

  if (wifiSubCursor == 0) { tft.fillRect(4, 38, tft.width()-8, 22, tft.color565(0,60,60)); tft.setTextColor(TFT_GREEN, tft.color565(0,60,60)); }
  else tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString(wifiEnabled ? "MODEM: ACTIVE" : "MODEM: DISABLED", 12, 41, 2);
  
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString("SSID: ESP32-Scope", 12, 68, 2);
  tft.drawString("PASS: 12345678", 12, 86, 2);
  tft.setTextColor(tft.color565(0, 255, 150), TFT_BLACK);
  tft.drawString("IP:   192.168.4.1", 12, 104, 2);

  if (wifiSubCursor == 1) { tft.fillRect(4, 132, tft.width()-8, 22, tft.color565(40,40,40)); tft.setTextColor(TFT_GREEN, tft.color565(40,40,40)); }
  else tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("[ BACK TO MENU ]", 12, 135, 2);
}

void drawKhinkaliScreen() {
  if (khinkaliRunning && millis() - lastKhinkaliSecTick >= 1000) {
    lastKhinkaliSecTick = millis();
    if (khinkaliTimerSec > 0) {
      khinkaliTimerSec--;
      steamAnimFrame = (steamAnimFrame + 1) % 3;
    }
  }
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString("🥟 KHINKALI COOKING PROFILE 🥟", 15, 8, 2);
  tft.drawFastHLine(0, 26, tft.width(), TFT_YELLOW);

  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  if (khinkaliRunning && khinkaliTimerSec > 0) {
    if (steamAnimFrame == 0) tft.drawString("  ~   ~   ~  ", 100, 42, 2);
    else if (steamAnimFrame == 1) tft.drawString("   ~   ~   ~ ", 100, 42, 2);
    else tft.drawString(" ~   ~   ~   ", 100, 42, 2);
  }
  tft.setTextColor(tft.color565(200, 180, 140), TFT_BLACK);
  tft.drawString("    ( ( 🥟 ) )    ", 80, 60, 2);

  int mins = khinkaliTimerSec / 60; int secs = khinkaliTimerSec % 60;
  char timeStr[16]; snprintf(timeStr, sizeof(timeStr), "%02d:%02d", mins, secs);
  tft.setTextColor(TFT_CYAN, TFT_BLACK); tft.drawString("TIME REMAINING:", 25, 102, 2);
  
