pahalllooolll/scope_esp32s3/scope_esp32s3.ino
  if (khinkaliTimerSec == 0 && khinkaliRunning) {
    tft.setTextColor(TFT_RED, TFT_BLACK); tft.drawString("!! READY !!", 150, 102, 2);
    // Сигнализация о готовности
    if (millis() % 1000 < 500) beep(1000, 200);
  } else {
    tft.setTextColor(TFT_GREEN, TFT_BLACK); tft.drawString(timeStr, 160, 102, 2);
  }
}

void handleButtons() {
  bool rUP    = digitalRead(BTN_UP);
  bool rDOWN  = digitalRead(BTN_DOWN);
  bool rLEFT  = digitalRead(BTN_LEFT);
  bool rRIGHT = digitalRead(BTN_RIGHT);
  bool rOK    = digitalRead(BTN_OK);

  // --- КНОПКА OK ---
  if (rOK == LOW && lastStateOK == HIGH) {
    beep(2000, 30);
    delay(30);
    if (currentMode == 0) { 
      currentMode = 1; menuCursor = 0; menuScrollOffset = 0; initMenuScreen(); 
    }
    else if (currentMode == 1) {
      if (menuCursor == 0) { currentMode = 4; pinsSubCursor = 0; tft.fillScreen(TFT_BLACK); tft.drawString("=== CHANNELS ===", 80, 8, 2); }
      else if (menuCursor == 14) { currentMode = 3; wifiSubCursor = 0; updateWiFiMenuDisplay(); }
      else if (menuCursor == 15) { currentMode = 5; khinkaliTimerSec = 420; khinkaliRunning = false; } 
      else if (menuCursor == 16) { currentMode = 0; tft.fillScreen(TFT_BLACK); xPos = 0; }
    }
    else if (currentMode == 4) { 
      if (pinsSubCursor < 3) { 
        pinColorIndices[pinsSubCursor] = (pinColorIndices[pinsSubCursor] + 1) % 7; saveSettings();
      } else { currentMode = 1; initMenuScreen(); } 
    }
    else if (currentMode == 3) { 
      if (wifiSubCursor == 0) toggleWiFi(); else { currentMode = 1; initMenuScreen(); } 
    }
  }
  lastStateOK = rOK;

  // --- КНОПКА ВВЕРХ ---
  if (rUP == LOW && lastStateUP == HIGH) {
    beep(2000, 30);
    delay(30); 
    if (currentMode == 0) { isFrozen = !isFrozen; }
    else if (currentMode == 1) { menuCursor--; if (menuCursor < 0) menuCursor = MENU_ITEMS_COUNT - 1; }
    else if (currentMode == 4) { pinsSubCursor--; if (pinsSubCursor < 0) pinsSubCursor = 3; }
    else if (currentMode == 3) { wifiSubCursor--; if (wifiSubCursor < 0) wifiSubCursor = 1; updateWiFiMenuDisplay(); }
    else if (currentMode == 5) { khinkaliRunning = !khinkaliRunning; if (khinkaliRunning) lastKhinkaliSecTick = millis(); }
  }
  lastStateUP = rUP;

  // --- КНОПКА ВНИЗ ---
  if (rDOWN == LOW && lastStateDOWN == HIGH) {
    beep(2000, 30);
    delay(30);
    if (currentMode == 1) { menuCursor++; if (menuCursor >= MENU_ITEMS_COUNT) menuCursor = 0; }
    else if (currentMode == 4) { pinsSubCursor = (pinsSubCursor + 1) % 4; }
    else if (currentMode == 3) { wifiSubCursor = (wifiSubCursor + 1) % 2; updateWiFiMenuDisplay(); }
    else if (currentMode == 5) { currentMode = 1; khinkaliRunning = false; initMenuScreen(); } 
  }
  lastStateDOWN = rDOWN;

  // --- КНОПКА ПРАВО ---
  if (rRIGHT == LOW && lastStateRIGHT == HIGH) {
    beep(2000, 30);
    delay(30);
    if (currentMode == 0) { graphSpeed += 5; if (graphSpeed > 30) graphSpeed = 30; }
    else if (currentMode == 1) {
      if (menuCursor == 1) zoomIndex = (zoomIndex + 1) % 4;
      else if (menuCursor == 2) smoothLevel = (smoothLevel + 1) % 4;
      else if (menuCursor == 3) graphSpeed = (graphSpeed + 5) % 35;
      else if (menuCursor == 4) useGrid = !useGrid;
      else if (menuCursor == 5) triggerMode = (triggerMode + 1) % 2;
      else if (menuCursor == 6) couplingMode = (couplingMode + 1) % 2;
      else if (menuCursor == 7) vDivIndex = (vDivIndex + 1) % 3;
      else if (menuCursor == 8) { themeColorIdx = (themeColorIdx + 1) % 4; initMenuScreen(); }
      else if (menuCursor == 9) buzzerEnabled = !buzzerEnabled;
      else if (menuCursor == 10) { testFreqIndex = (testFreqIndex + 1) % NUM_FREQS; generatorChanged = true; }
      else if (menuCursor == 11) { ledMode = (ledMode + 1) % 4; updateLED(); }
      else if (menuCursor == 12) { ledColorIndex = (ledColorIndex + 1) % 7; updateLED(); }
      else if (menuCursor == 13) { brightnessIndex = (brightnessIndex + 1) % 3; updateBrightness(); }
      saveSettings();
    }
    else if (currentMode == 4) { 
      if (pinsSubCursor < 3) { pinEnabled[pinsSubCursor] = !pinEnabled[pinsSubCursor]; saveSettings(); }
    }
  }
  lastStateRIGHT = rRIGHT;

  // --- КНОПКА ЛЕВО ---
  if (rLEFT == LOW && lastStateLEFT == HIGH) {
    beep(2000, 30);
    delay(30);
    if (currentMode == 0) { graphSpeed -= 5; if (graphSpeed < 0) graphSpeed = 0; } 
    else if (currentMode == 1) {
      if (menuCursor == 1) zoomIndex = (zoomIndex - 1 + 4) % 4;
      else if (menuCursor == 2) smoothLevel = (smoothLevel - 1 + 4) % 4;
      else if (menuCursor == 3) { graphSpeed -= 5; if (graphSpeed < 0) graphSpeed = 30; }
      else if (menuCursor == 4) useGrid = !useGrid;
      else if (menuCursor == 5) triggerMode = (triggerMode - 1 + 2) % 2;
      else if (menuCursor == 6) couplingMode = (couplingMode - 1 + 2) % 2;
      else if (menuCursor == 7) vDivIndex = (vDivIndex - 1 + 3) % 3;
      else if (menuCursor == 8) { themeColorIdx = (themeColorIdx - 1 + 4) % 4; initMenuScreen(); }
      else if (menuCursor == 9) buzzerEnabled = !buzzerEnabled;
      else if (menuCursor == 10) { testFreqIndex = (testFreqIndex - 1 + NUM_FREQS) % NUM_FREQS; generatorChanged = true; }
      else if (menuCursor == 11) { ledMode = (ledMode - 1 + 4) % 4; updateLED(); }
      else if (menuCursor == 12) { ledColorIndex = (ledColorIndex - 1 + 7) % 7; updateLED(); }
      else if (menuCursor == 13) { brightnessIndex = (brightnessIndex - 1 + 3) % 3; updateBrightness(); }
      saveSettings();
    }
  }
  lastStateLEFT = rLEFT;
}

void toggleWiFi() { 
  wifiEnabled = !wifiEnabled; 
  if (wifiEnabled) { WiFi.softAP("ESP32-Scope", "12345678"); server.begin(); } 
  else { WiFi.softAPdisconnect(true); } 
  saveSettings(); 
}

void updateBrightness() { analogWrite(TFT_BL_PIN, brightnessLevels[brightnessIndex]); }

void updateGenerator() {
  uint32_t freq = testFreqs[testFreqIndex];
  uint8_t bits = (freq <= 100) ? 14 : (freq <= 10000) ? 10 : 8;
  uint32_t duty = (1 << bits) / 2; 
  #if ESP_IDF_VERSION_MAJOR >= 5
    ledcDetach(TEST_WAVE_PIN); delay(2); ledcAttach(TEST_WAVE_PIN, freq, bits);
    ledcWrite(TEST_WAVE_PIN, duty);
  #else
    ledcSetup(0, freq, bits); ledcAttachPin(TEST_WAVE_PIN, 0); ledcWrite(0, duty); 
  #endif
}

void loadSettings() {
  prefs.begin("oscin", true);
  pinEnabled[0] = prefs.getBool("p0_en", true); pinEnabled[1] = prefs.getBool("p1_en", true); pinEnabled[2] = prefs.getBool("p2_en", true);
  pinColorIndices[0] = prefs.getInt("p0_col", 5); pinColorIndices[1] = prefs.getInt("p1_col", 2); pinColorIndices[2] = prefs.getInt("p2_col", 6);
  graphSpeed = prefs.getInt("speed", 10); smoothLevel = prefs.getInt("smooth_l", 2); zoomIndex = prefs.getInt("zoom_idx", 0); useGrid = prefs.getBool("grid", true);
  ledMode = prefs.getInt("lmode", 2); ledColorIndex = prefs.getInt("lcolor", 0); testFreqIndex = prefs.getInt("gen_idx", 2); wifiEnabled = prefs.getBool("wifi_en", true);
  brightnessIndex = prefs.getInt("brg_idx", 0); triggerMode = prefs.getInt("trig", 0); couplingMode = prefs.getInt("coup", 0);
  vDivIndex = prefs.getInt("vdiv", 1); themeColorIdx = prefs.getInt("theme", 0); buzzerEnabled = prefs.getBool("buzz", false);
  prefs.end();
}

void saveSettings() {
  prefs.begin("oscin", false); 
  prefs.putBool("p0_en", pinEnabled[0]); prefs.putBool("p1_en", pinEnabled[1]); prefs.putBool("p2_en", pinEnabled[2]);
  prefs.putInt("p0_col", pinColorIndices[0]); prefs.putInt("p1_col", pinColorIndices[1]); prefs.putInt("p2_col", pinColorIndices[2]);
  prefs.putInt("speed", graphSpeed); prefs.putInt("smooth_l", smoothLevel); prefs.putInt("zoom_idx", zoomIndex); prefs.putBool("grid", useGrid);            
  prefs.putInt("lmode", ledMode); prefs.putInt("lcolor", ledColorIndex); prefs.putInt("gen_idx", testFreqIndex); prefs.putBool("wifi_en", wifiEnabled);     
  prefs.putInt("brg_idx", brightnessIndex); prefs.putInt("trig", triggerMode); prefs.putInt("coup", couplingMode);
  prefs.putInt("vdiv", vDivIndex); prefs.putInt("theme", themeColorIdx); prefs.putBool("buzz", buzzerEnabled); 
  prefs.end();
}

