pahalllooolll/scope_esp32s3/scope_esp32s3.ino
void updateLED() { 
  if (ledMode == 0) { led.setPixelColor(0, 0); led.show(); } 
  else if (ledMode == 1) { led.setPixelColor(0, led.Color(ledRGBValues[ledColorIndex][0], ledRGBValues[ledColorIndex][1], ledRGBValues[ledColorIndex][2])); led.show(); } 
}

void handleLEDAnimations() {
  if (ledMode < 2) return;
  if (millis() - lastLedUpdate >= 20) {
    lastLedUpdate = millis();
    if (ledMode == 2) { led.setPixelColor(0, ledWheel(rainbowHue)); led.show(); rainbowHue += 2; } 
    else if (ledMode == 3) {
      sweepVal += sweepDirection * 4;
      if (sweepVal >= 255) { sweepVal = 255; sweepDirection = -1; } if (sweepVal <= 10) { sweepVal = 10; sweepDirection = 1; }
      led.setPixelColor(0, led.Color((ledRGBValues[ledColorIndex][0]*sweepVal)/255, (ledRGBValues[ledColorIndex][1]*sweepVal)/255, (ledRGBValues[ledColorIndex][2]*sweepVal)/255)); led.show();
    }
  }
}

uint32_t ledWheel(uint8_t wheelPos) { 
  wheelPos = 255 - wheelPos;
  if (wheelPos < 85) return led.Color(255 - wheelPos * 3, 0, wheelPos * 3);
  else if (wheelPos < 170) { wheelPos -= 85; return led.Color(0, wheelPos * 3, 255 - wheelPos * 3); } 
  else { wheelPos -= 170; return led.Color(wheelPos * 3, 255 - wheelPos * 3, 0); } 
}

void drawGrid() { 
  int yTop = 32; int yBottom = tft.height() - 1; int h = yBottom - yTop;
  uint16_t gridColor = tft.color565(40, 40, 50); 
  for (int i = 1; i < 4; i++) tft.drawFastHLine(0, yTop + (h * i) / 4, tft.width(), gridColor);
  for (int i = 1; i < 6; i++) tft.drawFastVLine((tft.width() * i) / 6, yTop, h, gridColor);
}

// ИСПРАВЛЕННЫЙ ОСЦИЛЛОГРАФ (Отцентрированный Zoom и разделение каналов)
void drawOscilloscope() {
  int yTop = 32; 
  int yBottom = tft.height() - 1; 
  bool anyActive = false;
  
  for (int i = 0; i < NUM_ADC_PINS; i++) {
    if (pinEnabled[i]) anyActive = true; 
  }
  
  if (!anyActive) {
    if (xPos == 0) { 
      tft.fillRect(0, yTop, tft.width(), tft.height() - yTop, TFT_BLACK); 
      if (useGrid) drawGrid(); 
      tft.setTextColor(TFT_RED, TFT_BLACK); 
      tft.drawString("NO ACTIVE CH", 70, yTop + 40, 2); 
    }
    xPos++;
    if (xPos >= tft.width()) xPos = 0; 
    if (graphSpeed > 0) delay(graphSpeed); 
    return;
  }
  
  int primaryIdx = 0;
  for (int i = 0; i < NUM_ADC_PINS; i++) { 
    if (pinEnabled[i]) { primaryIdx = i; break; } 
  }
  
  if (xPos == 0 && triggerMode == 1 && (lastMaxAdc - lastMinAdc) < 150) {
    delay(10); 
    return; 
  }

  if (xPos == 0) {
    unsigned long sweepDuration = millis() - sweepStartTime; 
    if (sweepDuration > 0 && (lastMaxAdc - lastMinAdc) > 250 && crossings > 0) {
      freqHz = (crossings * 1000.0) / sweepDuration; 
    } else {
      freqHz = 0.0; 
    }
    vMax = (lastMaxAdc * 3.3) / 4095.0; 
    vMin = (lastMinAdc * 3.3) / 4095.0; 
    
    lastMinAdc = currentMinAdc; 
    lastMaxAdc = currentMaxAdc; 
    currentMinAdc = 4095; 
    currentMaxAdc = 0; 
    crossings = 0; 
    sweepStartTime = millis(); 
    prevX = 0; 
    
    tft.fillRect(0, yTop, tft.width(), tft.height() - yTop, TFT_BLACK); 
    if (useGrid) drawGrid(); 
  }
  
  for (int i = 0; i < NUM_ADC_PINS; i++) {
    if (!pinEnabled[i]) continue; 
    
    int adcValue = 0; 
    int samples = (smoothLevel == 1) ? 5 : (smoothLevel == 2) ? 20 : (smoothLevel == 3) ? 50 : 1; 
    
    if (samples > 1) { 
      long adcTotal = 0;
      for (int s = 0; s < samples; s++) adcTotal += analogRead(adcPins[i]); 
      adcValue = adcTotal / samples;
    } else { 
      adcValue = analogRead(adcPins[i]); 
    }

    if (i == primaryIdx) {
      waveBuffer[waveBufferIdx] = adcValue; 
      if (xPos == 0) waveBufferIdx = (waveBufferIdx + 1) % WAVE_BUFFER_SIZE; 
      
      if (adcValue > currentMaxAdc) currentMaxAdc = adcValue; 
      if (adcValue < currentMinAdc) currentMinAdc = adcValue; 
      
      int range = (lastMaxAdc - lastMinAdc); 
      int midpoint = (lastMinAdc + lastMaxAdc) / 2; 
      int hysteresis = (range / 8 < 40) ? 40 : range / 8; 
      
      if (range > 250) { 
        if (!wasAboveMidpoint && (adcValue > (midpoint + hysteresis))) { 
          crossings++; 
          wasAboveMidpoint = true; 
        } else if (wasAboveMidpoint && (adcValue < (midpoint - hysteresis))) { 
          wasAboveMidpoint = false; 
        } 
      }
      voltage = (adcValue * 3.3) / 4095.0; 
    }
    
    if (couplingMode == 1) {
      int mid = (lastMinAdc + lastMaxAdc) / 2; 
      adcValue = (adcValue - mid) + 2048; 
    }
    
    int zoomedAdc = adcValue;
    
    if (vDivIndex == 0) {
        zoomedAdc = (zoomedAdc - 2048) * 2 + 2048; 
    } else if (vDivIndex == 2) {
        zoomedAdc = (zoomedAdc - 2048) / 2 + 2048; 
    }

    if (zoomLevels[zoomIndex] > 1) {
        zoomedAdc = (zoomedAdc - 2048) * zoomLevels[zoomIndex] + 2048; 
    }

    if (zoomedAdc > 4095) zoomedAdc = 4095; 
    if (zoomedAdc < 0) zoomedAdc = 0; 
    
    int yPos = map(zoomedAdc, 0, 4095, yBottom, yTop); 
    if (xPos == 0) prevYPins[i] = yPos; 
    
    tft.drawLine(prevX, prevYPins[i], xPos, yPos, avaliableColors[pinColorIndices[i]]); 
    prevYPins[i] = yPos; 
  }
  
  tft.setTextColor(themeColors[themeColorIdx], TFT_BLACK); 
  char topText[64]; 
  if (freqHz < 1000.0) {
    snprintf(topText, sizeof(topText), "V:%.1f| ^%.1f _%.1f| %dHz ", voltage, vMax, vMin, (int)freqHz); 
  } else {
    snprintf(topText, sizeof(topText), "V:%.1f| ^%.1f _%.1f| %.1fkHz ", voltage, vMax, vMin, freqHz / 1000.0); 
  }
  tft.drawString(topText, 4, 8, 2); 
  
  prevX = xPos; 
  xPos++; 
  if (xPos >= tft.width()) xPos = 0; 
  if (graphSpeed > 0) delay(graphSpeed); 
}